#### Lisa Over
CMPINF 2110<br>
Homework 4: Bob Ross<br>
March 10, 2021

In [441]:
import sys
print(sys.executable)

/Users/lisa/opt/anaconda3/envs/cmpinf_2110/bin/python

In [442]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import seaborn as sns

#### Read in data: tidy data and separate titles data

In [443]:
data_file = 'ross_episodes_tidy.csv'
df_tidy = pd.read_csv( data_file )

In [444]:
df_tidy.head()

   season  episode    feature    artist artist_name artist_relationship
0       1        1     BUSHES  BOB_ROSS    Bob Ross             Himself
1       1        1  DECIDUOUS  BOB_ROSS    Bob Ross             Himself
2       1        1      GRASS  BOB_ROSS    Bob Ross             Himself
3       1        1      RIVER  BOB_ROSS    Bob Ross             Himself
4       1        1       TREE  BOB_ROSS    Bob Ross             Himself

In [445]:
data_file = 'ross_titles.csv'
df_titles = pd.read_csv( data_file )
df_titles.head()

   season  episode                  TITLE
0       1        1  "A WALK IN THE WOODS"
1       1        2         "MT. MCKINLEY"
2       1        3         "EBONY SUNSET"
3       1        4          "WINTER MIST"
4       1        5         "QUIET STREAM"

#### Clean up df_tidy

In [446]:
df_tidy['feature'] = df_tidy['feature'].str.replace('_', ' ')

In [447]:
df_tidy['feature'] = df_tidy.feature.str.title()
df_tidy

,season,episode,feature,artist,artist_name,artist_relationship
0,1,1,Bushes,BOB_ROSS,Bob Ross,Himself
1,1,1,Deciduous,BOB_ROSS,Bob Ross,Himself
2,1,1,Grass,BOB_ROSS,Bob Ross,Himself
3,1,1,River,BOB_ROSS,Bob Ross,Himself
4,1,1,Tree,BOB_ROSS,Bob Ross,Himself
...,...,...,...,...,...,...
3185,4,11,Mountain,DIANE_ANDRE,Diane Andre,Friend
3186,4,11,Mountains,DIANE_ANDRE,Diane Andre,Friend
3187,4,11,Snowy Mountain,DIANE_ANDRE,Diane Andre,Friend
3188,4,11,Tree,DIANE_ANDRE,Diane Andre,Friend
3189,4,11,Trees,DIANE_ANDRE,Diane Andre,Friend

#### Clean up df_titles

In [448]:
df_titles.loc[(df_titles['season'] == 9) & (df_titles['episode'] == 13)]

     season  episode                 TITLE
116       9       13  "MOUNTAIN HIDE-AWAY"

In [449]:
df_titles.iloc[116,2] = 'Mountain Hideaway'

In [450]:
df_titles.loc[(df_titles['season'] == 9) & (df_titles['episode'] == 13)]

     season  episode              TITLE
116       9       13  Mountain Hideaway

In [451]:
df_titles.rename(columns={'TITLE':'title'}, inplace=True)

In [452]:
df_titles['title'] = df_titles['title'].str.replace(r"[\"\',]", '')

<ipython-input-452-b2f71bd5ff22>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_titles['title'] = df_titles['title'].str.replace(r"[\"\',]", '')

In [453]:
df_titles['title'] = df_titles['title'].str.replace(r"[\-\',]", ' ')

<ipython-input-453-ae55937bbe7d>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_titles['title'] = df_titles['title'].str.replace(r"[\-\',]", ' ')

In [454]:
df_titles.head()

   season  episode                title
0       1        1  A WALK IN THE WOODS
1       1        2         MT. MCKINLEY
2       1        3         EBONY SUNSET
3       1        4          WINTER MIST
4       1        5         QUIET STREAM

In [455]:
df_titles['title'] = df_titles.title.str.title()
df_titles

     season  episode                   title
0         1        1     A Walk In The Woods
1         1        2            Mt. Mckinley
2         1        3            Ebony Sunset
3         1        4             Winter Mist
4         1        5            Quiet Stream
..      ...      ...                     ...
398      31        9        Evergreen Valley
399      31       10             Balmy Beach
400      31       11       Lake At The Ridge
401      31       12  In The Midst Of Winter
402      31       13          Wilderness Day

[403 rows x 3 columns]

#### Create artists entity with artist_id, artist_name, and artist_relationship

In [456]:
artists_entity = df_tidy.groupby(['artist', 'artist_name', 'artist_relationship']).size().reset_index(name='num_rows')

In [457]:
artists_entity.drop(['num_rows'], axis=1, inplace=True)

In [458]:
artists_entity.drop(['artist'], axis=1, inplace=True)

In [459]:
artists_entity['artist_id'] = artists_entity.index + 1
artists_entity

   artist_name artist_relationship  artist_id
0     Bob Ross             Himself          1
1  Diane Andre              Friend          2
2        Other             Friends          3
3   Steve Ross                 Son          4

#### Create paintings entity table with title, season, episode, and artist_id

Merge artist_entity data with data containing artist_name; merge on artist_name

In [460]:
artist_per_episode = df_tidy.groupby(['season','episode','artist_name']).size().reset_index(name='num_rows')

In [461]:
artist_merge = pd.merge(artist_per_episode, 
                           artists_entity,
                           how="left",
                           on="artist_name")
artist_merge.head()

   season  episode artist_name  num_rows artist_relationship  artist_id
0       1        1    Bob Ross         6             Himself          1
1       1        2    Bob Ross         9             Himself          1
2       1        3    Bob Ross        10             Himself          1
3       1        4    Bob Ross         8             Himself          1
4       1        5    Bob Ross         5             Himself          1

Merge artist_ids with data containing titles; merge on season and episode.

In [462]:
titles_merge = pd.merge(df_titles, 
                           artist_merge,
                           how="left",
                           on=['season','episode'])
titles_merge.head()

,season,episode,title,artist_name,num_rows,artist_relationship,artist_id
0,1,1,A Walk In The Woods,Bob Ross,6,Himself,1
1,1,2,Mt. Mckinley,Bob Ross,9,Himself,1
2,1,3,Ebony Sunset,Bob Ross,10,Himself,1
3,1,4,Winter Mist,Bob Ross,8,Himself,1
4,1,5,Quiet Stream,Bob Ross,5,Himself,1

In [463]:
paintings_entity = titles_merge[['season','episode','title','artist_id']].copy()
paintings_entity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 403 entries, 0 to 402
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   season     403 non-null    int64
 1   episode    403 non-null    int64
 2   title      403 non-null    object
 3   artist_id  403 non-null    int64
dtypes: int64(3), object(1)
memory usage: 15.7+ KB

In [464]:
paintings_entity

     season  episode                   title  artist_id
0         1        1     A Walk In The Woods          1
1         1        2            Mt. Mckinley          1
2         1        3            Ebony Sunset          1
3         1        4             Winter Mist          1
4         1        5            Quiet Stream          1
..      ...      ...                     ...        ...
398      31        9        Evergreen Valley          1
399      31       10             Balmy Beach          1
400      31       11       Lake At The Ridge          4
401      31       12  In The Midst Of Winter          1
402      31       13          Wilderness Day          1

[403 rows x 4 columns]

#### Create features entity table with feature_name

In [465]:
features_entity = df_tidy.groupby(['feature']).size().reset_index(name='num_rows')

In [466]:
features_entity.drop(['num_rows'], axis=1, inplace=True)

In [467]:
features_entity['feature_id'] = features_entity.index + 1
features_entity

            feature  feature_id
0       Apple Frame           1
1   Aurora Borealis           2
2              Barn           3
3             Beach           4
4              Boat           5
..              ...         ...
58            Waves          59
59         Windmill          60
60     Window Frame          61
61           Winter          62
62      Wood Framed          63

[63 rows x 2 columns]

#### Create painting to features link table

In [468]:
features_per_episode = df_tidy[['season','episode','feature']].copy()
features_per_episode.head()

   season  episode    feature
0       1        1     Bushes
1       1        1  Deciduous
2       1        1      Grass
3       1        1      River
4       1        1       Tree

In [469]:
missing_feature = features_per_episode.loc[features_per_episode['feature'].isna(), :]
missing_feature.head()

      season  episode feature
824        9       10     NaN
1439      15        4     NaN
2546      26       10     NaN

In [470]:
df_tidy.loc[(df_tidy['season'] == 9) & (df_tidy['episode'] == 10)]

     season  episode feature    artist artist_name artist_relationship
824       9       10     NaN  BOB_ROSS    Bob Ross             Himself

In [471]:
paintings_entity.loc[(paintings_entity['season'] == 9) & (paintings_entity['episode'] == 10)]

     season  episode          title  artist_id
113       9       10  Country Charm          1

In [472]:
df_tidy.loc[(df_tidy['season'] == 15) & (df_tidy['episode'] == 4)]

      season  episode feature    artist artist_name artist_relationship
1439      15        4     NaN  BOB_ROSS    Bob Ross             Himself

In [473]:
paintings_entity.loc[(paintings_entity['season'] == 15) & (paintings_entity['episode'] == 4)]

     season  episode                 title  artist_id
185      15        4  Peaceful Reflections          1

In [474]:
df_tidy.loc[(df_tidy['season'] == 26) & (df_tidy['episode'] == 10)]

      season  episode feature    artist artist_name artist_relationship
2546      26       10     NaN  BOB_ROSS    Bob Ross             Himself

In [475]:
paintings_entity.loc[(paintings_entity['season'] == 26) & (paintings_entity['episode'] == 10)]

     season  episode                  title  artist_id
334      26       10  Purple Mountain Range          1

In [476]:
features_per_episode = features_per_episode[~features_per_episode['feature'].isnull()]
features_per_episode.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3187 entries, 0 to 3189
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   season   3187 non-null   int64
 1   episode  3187 non-null   int64
 2   feature  3187 non-null   object
dtypes: int64(2), object(1)
memory usage: 99.6+ KB

In [477]:
features_link = pd.merge(features_per_episode, 
                           features_entity,
                           how="left",
                           on=['feature'])
features_link.head()

   season  episode    feature  feature_id
0       1        1     Bushes           8
1       1        1  Deciduous          17
2       1        1      Grass          27
3       1        1      River          46
4       1        1       Tree          55

In [478]:
features_link.drop(['feature'], axis=1, inplace=True)

In [479]:
features_link.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3187 entries, 0 to 3186
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   season      3187 non-null   int64
 1   episode     3187 non-null   int64
 2   feature_id  3187 non-null   int64
dtypes: int64(3)
memory usage: 99.6 KB

#### Export tables to CSV

In [480]:
paintings_entity.to_csv('ross_paintings.csv', index=False, na_rep='NULL')

In [481]:
artists_entity.to_csv('ross_artists.csv', index=False, na_rep='NULL')

In [482]:
features_entity.to_csv('ross_features.csv', index=False, na_rep='NULL')

In [483]:
features_link.to_csv('ross_features_link.csv', index=False, na_rep='NULL')